In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name" : ['a', 'b', 'c', 'd'],
    "marks" : [1,2,3,4],
    "city" : ['gurgaon' , 'delhi', 'kolkata', 'hyderabad']
}

# Creating DataFrame

In [3]:
df = pd.DataFrame(dict1)

In [4]:
print(df)

  name  marks       city
0    a      1    gurgaon
1    b      2      delhi
2    c      3    kolkata
3    d      4  hyderabad

# Converting the Dataframe to excel(csv file)

In [5]:
df.to_csv('friends.csv')

# Creating an excel sheet without certain column

In [6]:
df.to_csv('friends1.csv', index = False)

# Printing starting n rows from DataFrame

In [7]:
df.head(2)

  name  marks     city
0    a      1  gurgaon
1    b      2    delhi

# Printing ending n rows from DataFrame

In [8]:
df.tail(2)

  name  marks       city
2    c      3    kolkata
3    d      4  hyderabad

# Getting the Statistical analysis of numeric data

In [9]:
df.describe()

          marks
count  4.000000
mean   2.500000
std    1.290994
min    1.000000
25%    1.750000
50%    2.500000
75%    3.250000
max    4.000000

# To read a newly created excel sheet

In [10]:
read1 = pd.read_csv('try.csv')

In [11]:
print(read1)

  name  gender       city
0    a    male    gurgaon
1    b  female      delhi
2    c    male    kolkata
3    d  female  hyderabad

# To get details of a specific column

In [12]:
read1['name']

0    a
1    b
2    c
3    d
Name: name, dtype: object

In [13]:
read1['name'][0]

'a'

# To permanently change a value of a particular field

In [14]:
read1['name'][3] = 'da'

In [15]:
print(read1)

  name  gender       city
0    a    male    gurgaon
1    b  female      delhi
2    c    male    kolkata
3   da  female  hyderabad

In [16]:
read1.to_csv('try.csv')

# Types of datatypes in python

# Series and Dataframe

# 1. Series

In [19]:
ser = pd.Series(np.random.rand(16))

In [20]:
print(ser)

0     0.990918
1     0.846307
2     0.056707
3     0.669873
4     0.676085
5     0.195876
6     0.316213
7     0.827727
8     0.935344
9     0.172149
10    0.521399
11    0.001331
12    0.577201
13    0.977850
14    0.013687
15    0.802621
dtype: float64

# 2. Dataframe

In [23]:
ser2 = pd.DataFrame(np.random.rand(20,4), index = np.arange(20))

In [25]:
print(ser2.head(5))

          0         1         2         3
0  0.958262  0.169668  0.963327  0.215022
1  0.966140  0.864291  0.085314  0.965421
2  0.918913  0.156509  0.133876  0.352231
3  0.098717  0.798985  0.270376  0.674492
4  0.244849  0.358204  0.593065  0.360734

In [26]:
ser2.describe()

               0          1          2          3
count  20.000000  20.000000  20.000000  20.000000
mean    0.507748   0.472818   0.424052   0.515921
std     0.329407   0.252944   0.276106   0.298522
min     0.095554   0.064579   0.014835   0.085606
25%     0.187017   0.296580   0.243199   0.270148
50%     0.494806   0.488092   0.393482   0.502491
75%     0.736338   0.657744   0.595449   0.776446
max     0.999446   0.864291   0.963327   0.976178

# To convert DataFrame into numpy arrays

In [27]:
ser2.to_numpy()

array([[0.9582621 , 0.16966789, 0.96332729, 0.21502201],
       [0.96613959, 0.86429099, 0.08531407, 0.96542103],
       [0.91891346, 0.15650938, 0.13387601, 0.35223119],
       [0.09871733, 0.79898527, 0.27037561, 0.67449154],
       [0.24484906, 0.3582036 , 0.59306494, 0.36073414],
       [0.13500224, 0.53636535, 0.88005153, 0.43558674],
       [0.17301995, 0.6331652 , 0.31379305, 0.67068186],
       [0.19047174, 0.34761113, 0.50280831, 0.22533449],
       [0.67547954, 0.52020294, 0.41430522, 0.86531285],
       [0.98615988, 0.75991139, 0.37265827, 0.31607378],
       [0.17665361, 0.7155125 , 0.50843386, 0.11225912],
       [0.64356677, 0.63848761, 0.3099889 , 0.81114363],
       [0.52685336, 0.07631105, 0.01483465, 0.15444101],
       [0.99944616, 0.25948005, 0.60259984, 0.08560574],
       [0.65908983, 0.30894679, 0.29458239, 0.90060448],
       [0.58482417, 0.45598014, 0.07390522, 0.56939449],
       [0.46275802, 0.06457874, 0.16167074, 0.76488003],
       [0.32844553, 0.41273077, 0.63545901, 0.28508626],
       [0.09555406, 0.54786689, 0.87394318, 0.97617824],
       [0.33076349, 0.83156187, 0.47604509, 0.57793167]])

In [28]:
ser2.sort_index(axis = 0, ascending = False)

           0         1         2         3
19  0.330763  0.831562  0.476045  0.577932
18  0.095554  0.547867  0.873943  0.976178
17  0.328446  0.412731  0.635459  0.285086
16  0.462758  0.064579  0.161671  0.764880
15  0.584824  0.455980  0.073905  0.569394
14  0.659090  0.308947  0.294582  0.900604
13  0.999446  0.259480  0.602600  0.085606
12  0.526853  0.076311  0.014835  0.154441
11  0.643567  0.638488  0.309989  0.811144
10  0.176654  0.715512  0.508434  0.112259
9   0.986160  0.759911  0.372658  0.316074
8   0.675480  0.520203  0.414305  0.865313
7   0.190472  0.347611  0.502808  0.225334
6   0.173020  0.633165  0.313793  0.670682
5   0.135002  0.536365  0.880052  0.435587
4   0.244849  0.358204  0.593065  0.360734
3   0.098717  0.798985  0.270376  0.674492
2   0.918913  0.156509  0.133876  0.352231
1   0.966140  0.864291  0.085314  0.965421
0   0.958262  0.169668  0.963327  0.215022

# Creating views: Method 1

# note:- changing a value in view directly affects the original i.e the original also changes with change in view

In [30]:
ser2view = ser2

In [32]:
ser2view[0][0] = 1100

C:\Users\Manisha\AppData\Local\Temp\ipykernel_21228\307610840.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  ser2view[0][0] = 1100

In [34]:
print(ser2.head(5))

             0         1         2         3
0  1100.000000  0.169668  0.963327  0.215022
1     0.966140  0.864291  0.085314  0.965421
2     0.918913  0.156509  0.133876  0.352231
3     0.098717  0.798985  0.270376  0.674492
4     0.244849  0.358204  0.593065  0.360734

# Creating views: Method 2

# note:- changing a value in view dosent affect the original i.e the original does not change with change in view, a copy is created

In [36]:
ser2view2 = ser2.copy()

In [37]:
ser2view2[0][0] = 123

C:\Users\Manisha\AppData\Local\Temp\ipykernel_21228\1110198303.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  ser2view2[0][0] = 123

In [39]:
print(ser2.head(5))

             0         1         2         3
0  1100.000000  0.169668  0.963327  0.215022
1     0.966140  0.864291  0.085314  0.965421
2     0.918913  0.156509  0.133876  0.352231
3     0.098717  0.798985  0.270376  0.674492
4     0.244849  0.358204  0.593065  0.360734

# To change value

In [40]:
ser2.loc[0,0] = 123

In [42]:
print(ser2.head(5))

            0         1         2         3
0  123.000000  0.169668  0.963327  0.215022
1    0.966140  0.864291  0.085314  0.965421
2    0.918913  0.156509  0.133876  0.352231
3    0.098717  0.798985  0.270376  0.674492
4    0.244849  0.358204  0.593065  0.360734

# To drop a column

In [44]:
ser2.drop(3, axis = 1)

             0         1         2
0   123.000000  0.169668  0.963327
1     0.966140  0.864291  0.085314
2     0.918913  0.156509  0.133876
3     0.098717  0.798985  0.270376
4     0.244849  0.358204  0.593065
5     0.135002  0.536365  0.880052
6     0.173020  0.633165  0.313793
7     0.190472  0.347611  0.502808
8     0.675480  0.520203  0.414305
9     0.986160  0.759911  0.372658
10    0.176654  0.715512  0.508434
11    0.643567  0.638488  0.309989
12    0.526853  0.076311  0.014835
13    0.999446  0.259480  0.602600
14    0.659090  0.308947  0.294582
15    0.584824  0.455980  0.073905
16    0.462758  0.064579  0.161671
17    0.328446  0.412731  0.635459
18    0.095554  0.547867  0.873943
19    0.330763  0.831562  0.476045

In [45]:
print(ser2.head())

            0         1         2         3
0  123.000000  0.169668  0.963327  0.215022
1    0.966140  0.864291  0.085314  0.965421
2    0.918913  0.156509  0.133876  0.352231
3    0.098717  0.798985  0.270376  0.674492
4    0.244849  0.358204  0.593065  0.360734

# To permanently delete a column

In [46]:
ser2 = ser2.drop(3, axis = 1)

In [47]:
print(ser2.head())

            0         1         2
0  123.000000  0.169668  0.963327
1    0.966140  0.864291  0.085314
2    0.918913  0.156509  0.133876
3    0.098717  0.798985  0.270376
4    0.244849  0.358204  0.593065

In [ ]:
ser2.drop(3, axis = 1, inplace = True)

# To get specific rows and columns

In [48]:
ser2.loc[[1,2],[0,1]]

          0         1
1  0.966140  0.864291
2  0.918913  0.156509

In [49]:
ser2.loc[[1,2], :]

          0         1         2
1  0.966140  0.864291  0.085314
2  0.918913  0.156509  0.133876

# To get specific set of values from a column

In [52]:
ser2.loc[(ser2[0]<0.5) & (ser2[1] > 0.5)]

           0         1         2
3   0.098717  0.798985  0.270376
5   0.135002  0.536365  0.880052
6   0.173020  0.633165  0.313793
10  0.176654  0.715512  0.508434
18  0.095554  0.547867  0.873943
19  0.330763  0.831562  0.476045

# iloc

# To get specific rows/columns

In [54]:
ser2.iloc[0,2]

np.float64(0.9633272851025148)

In [56]:
ser2.iloc[[0,8],[0]]

           0
0  123.00000
8    0.67548

# To reset index

In [57]:
ser2.reset_index()

    index           0         1         2
0       0  123.000000  0.169668  0.963327
1       1    0.966140  0.864291  0.085314
2       2    0.918913  0.156509  0.133876
3       3    0.098717  0.798985  0.270376
4       4    0.244849  0.358204  0.593065
5       5    0.135002  0.536365  0.880052
6       6    0.173020  0.633165  0.313793
7       7    0.190472  0.347611  0.502808
8       8    0.675480  0.520203  0.414305
9       9    0.986160  0.759911  0.372658
10     10    0.176654  0.715512  0.508434
11     11    0.643567  0.638488  0.309989
12     12    0.526853  0.076311  0.014835
13     13    0.999446  0.259480  0.602600
14     14    0.659090  0.308947  0.294582
15     15    0.584824  0.455980  0.073905
16     16    0.462758  0.064579  0.161671
17     17    0.328446  0.412731  0.635459
18     18    0.095554  0.547867  0.873943
19     19    0.330763  0.831562  0.476045